Autodesk.Revit.DB.ReferencePlane.Direction
The direction of the reference plane.
Remarks:
When setting this property, an exception will be thrown if the direction vector is not perpendicular to the normal vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: newDir has zero length.

Autodesk.Revit.DB.ReferencePlane.FreeEnd
The free end of the reference plane.
Remarks:
When setting this property, an exception will be thrown if the free end is set to
almost the same point as bubble end or if the vector from BubbleEnd -> FreeEnd is not perpendicular
to the normal vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.ReferencePlane.BubbleEnd
The bubble end of the reference plane.
Remarks:
When setting this property, an exception will be thrown if the bubble end is set to almost
the same point as free end or if the vector from BubbleEnd -> FreeEnd
is not perpendicular to the normal vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null